src/posts/oop-java-vs-cl.org
#+TITLE:     Orientação a Objetos: Java /versus/ Common Lisp
#+SETUPFILE: setupfile.org
#+LANGUAGE:  pt_BR
#+PROPERTY: header-args:lisp :cache yes :exports code :tangle yes
#+PROPERTY: header-args:java :cache yes :exports code :tangle yes
#+OPTIONS: toc:t
#+EVAL: (setq org-html-link-org-files-as-html nil)

#+AUTHOR: Lucas Vieira
#+EMAIL:  lucasvieira@lisp.com.br
#+DATE:   Jan 08, 2019

#+STARTUP: showall

* Introdução

Este é mais um post envolvendo programação literada no meu blog -- desta vez, em
Português mesmo.

Neste texto, pretendo falar a respeito de /programação orientada a objetos/,
apresentando um paralelo entre a forma como este paradigma foi adotado pela
indústria e a forma como foi originalmente concebido por Alan Kay[fn:1].

#+BEGIN_NOTES
*NOTA:* Este post foi escrito para meu blog utilizando ~org-mode~ no Emacs, o que
 possibilita a extração do código, na ordem apresentada, e salvamento do mesmo
 em seus respectivos arquivos das linguagens aqui utilizadas. Veja a conclusão
 para visualizar o arquivo ~.org~ da postagem, e para exportar os arquivos de
 código para arquivos externos.
#+END_NOTES

** História da concepção da /orientação a objetos/

Segundo Alan Kay, o paradigma de orientação a objetos foi inspirado pela antiga
linguagem /Simula/, que realizava certas operações (definidas por procedimentos)
sobre estruturas de dados. Kay via /Simula/ como algo que parecia querer chegar a
algo, mas ainda não sabia descrever o que era.

O conceito de orientação a objetos, como originalmente concebido, tinha como
base uma organização hierárquica originalmente vista na biologia. Poderia-se
compreender que organismos, em especial células, comportavam-se como estruturas
com comportamento interno complexo, porém opaco ao resto do sistema; o contato
da célula com o mundo exterior a ela e vice-versa era feito através de um /canal/,
que poderia ser compreendido como uma membrana externa, que filtra certas
/mensagens/ e decide como as responde, e se responde-as.

Ainda tomando este modelo de estrutura opaca com um canal de comunicação externo
por mensagens, percebeu-se que, quando aplicado um contexto matemático a esta
ideia, poderia surgir uma álgebra própria onde estas estruturas poderiam ser
manipuladas, de forma que esta troca de mensagens poderia ser descrita.

Às estruturas opacas, Alan Kay deu o nome de /objetos/, e estes foram os pilares
que o fizeram começar a trabalhar na linguagem Smalltalk. Para Kay, este
conceito de /objetos/ não significaria apenas estruturas em uma linguagem, mas
também formas de representar estruturas reais e criar meios de comunicação
abstrata (por exemplo, entre computadores em uma rede). A influência de
Smalltalk chegou à comunidade de (Common) Lisp e, eventualmente, surgiu o CLOS
(/Common Lisp Object System/).

Estes conceitos influenciaram na criação da linguagem C++ e de outras linguagens
que, por sua vez, possibilitaram a implementação da orientação a objetos na
indústria de hoje, o que incluiu o advento da linguagem Java. Nestas linguagens,
o principal foco está na organização de objetos como uma evolução de estruturas
de dados, contendo, internamente, campos de dados e métodos que este objeto
poderia executar, seja alterando seu próprio estado interno, seja comunicando-se
com outros objetos do contexto.

A orientação a objetos estabelecida na indústria e ensinada nas universidades
normalmente lembra a forma como classifica-se em C++ e Java, e acabou
tornando-se um assunto controverso entre os puristas e estudiosos do assunto.

** O que será feito?

Neste post, pretendo mostrar implementações em Java e Common Lisp,
respectivamente, como representantes de dois modos de pensar a respeito de
orientação a objetos: Java como sendo uma vertente mais associada a C++, e
Common Lisp como uma vertente mais associada a Smalltalk. Tentaremos resolver o
seguinte problema, que é extremamente simples:

#+BEGIN_QUOTE
Temos um certo conjunto de /formas/. Estas formas podem ser /círculos/, /quadrados/ ou
/pentágonos/, todos sendo formas regulares. Cada uma das formas têm suas
peculiaridades necessárias para a sua construção, como /raio/ ou /tamanho do
lado/. Gere um conjunto arbitrário de /formas/, e mostre as somas de seus
perímetros, as somas de suas áreas, e as somas do quadrado da medida do lado de
cada forma, caso seja possível.
#+END_QUOTE

*** ACHTUNG!

O objetivo deste exercício não é destacar uma linguagem ou uma visão do
paradigma como melhor que o outro, mas sim demonstrar a diferença no raciocínio
e na produção das soluções para o problema em questão. Evidenciam-se os
contrastes semânticos, acima dos sintáticos, ainda que não sejam completamente
dissociáveis.

Obviamente, possuo minhas próprias preferências com relação às linguagens
utilizadas, mas aqui pretendo apresentar uma espécie de pedra de roseta, e
deixar que o leitor tome suas próprias conclusões com relação às visões e formas
de resolução apresentadas.

Também não há a pretensão, aqui, de gerar código com excelência de performance,
sendo o entendimento do leitor o alvo mais importante. Todavia, como Common Lisp
pode ser uma linguagem muito ortodoxa, algumas seções incluem explicações extras
acerca da aparelhagem sintática da mesma. Recomendo abusar dos /links/ entre o
texto e notas de rodapé, e vice-versa.

