posts/oop-java-vs-cl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orientação a Objetos: Java /versus/ Common Lisp</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Programming, Tech, and occasional rant space by Lucas Vieira" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<link rel="alternate" type="application/atom+xml" title="The Alchemist's Hideout" href="/feed.xml" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/posts/oop-java-vs-cl.html">
<meta property="og:type" content="article">
<meta property="og:title" content="Orientação a Objetos: Java &amp;lt;i&amp;gt;versus&amp;lt;/i&amp;gt; Common Lisp">
<meta property="og:description" content="Programming, Tech, and occasional rant space by Lucas Vieira">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta property="article:author" content="Lucas S. Vieira">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/posts/oop-java-vs-cl.html">
<meta name="twitter:title" content="Orientação a Objetos: Java &amp;lt;i&amp;gt;versus&amp;lt;/i&amp;gt; Common Lisp">
<meta name="twitter:description" content="Programming, Tech, and occasional rant space by Lucas Vieira">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner-full.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Orientação a Objetos: Java <i>versus</i> Common Lisp</h1><p><i>Escrito em Jan 08, 2019 por Lucas S. Vieira</i></p>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9db83dc">Introdução</a>
<ul>
<li><a href="#org0adebeb">História da concepção da <i>orientação a objetos</i></a></li>
<li><a href="#org76de6f4">O que será feito?</a>
<ul>
<li><a href="#org9fe1a5a">ACHTUNG!</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8e8af10">OO do "jeito Java"</a>
<ul>
<li><a href="#org0919b9b">Inicialização</a></li>
<li><a href="#orgf2fbf70">Interface para as formas</a></li>
<li><a href="#org789a60a">Implementação das formas</a>
<ul>
<li><a href="#orgde65120">Círculo</a></li>
<li><a href="#orgbaca00a">Quadrado</a></li>
<li><a href="#org3edb0cf">Pentágono</a></li>
</ul>
</li>
<li><a href="#orgd337f94">Utilitários</a></li>
<li><a href="#org5c5632f">Ponto de entrada do programa</a></li>
</ul>
</li>
<li><a href="#org44db247">OO do "jeito Common Lisp"</a>
<ul>
<li><a href="#org4b255df">Inicialização</a></li>
<li><a href="#org81d215d">Operações genéricas</a></li>
<li><a href="#orgdb3711b">Classes</a></li>
<li><a href="#org3abe5e1">Métodos</a>
<ul>
<li><a href="#org25229df">Perímetro</a></li>
<li><a href="#org48ca923">Área</a></li>
<li><a href="#org5e93e40">Quadrado do lado</a></li>
</ul>
</li>
<li><a href="#org89c5910">Utilitários</a>
<ul>
<li><a href="#org3329c93">Soma dos quadrados dos lados</a></li>
</ul>
</li>
<li><a href="#org0c11e75">Função principal para testes</a></li>
</ul>
</li>
<li><a href="#org16c29c8">Conclusão</a>
<ul>
<li><a href="#org5505b2c">Comparação</a></li>
<li><a href="#org0d60e7e"><i>Tangling</i> dos arquivos</a></li>
<li><a href="#orgef1ddb8">Licenciamento</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9db83dc" class="outline-2">
<h2 id="org9db83dc">Introdução</h2>
<div class="outline-text-2" id="text-org9db83dc">
<p>
Este é mais um post envolvendo programação literada no meu blog &#x2013; desta vez, em
Português mesmo.
</p>

<p>
Neste texto, pretendo falar a respeito de <i>programação orientada a objetos</i>,
apresentando um paralelo entre a forma como este paradigma foi adotado pela
indústria e a forma como foi originalmente concebido por Alan Kay<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>

<div class="NOTES" id="orgff5c510">
<p>
<b>NOTA:</b> Este post foi escrito para meu blog utilizando <code>org-mode</code> no Emacs, o que
 possibilita a extração do código, na ordem apresentada, e salvamento do mesmo
 em seus respectivos arquivos das linguagens aqui utilizadas. Veja a conclusão
 para visualizar o arquivo <code>.org</code> da postagem, e para exportar os arquivos de
 código para arquivos externos.
</p>

</div>
</div>
<div id="outline-container-org0adebeb" class="outline-3">
<h3 id="org0adebeb">História da concepção da <i>orientação a objetos</i></h3>
<div class="outline-text-3" id="text-org0adebeb">
<p>
Segundo Alan Kay, o paradigma de orientação a objetos foi inspirado pela antiga
linguagem <i>Simula</i>, que realizava certas operações (definidas por procedimentos)
sobre estruturas de dados. Kay via <i>Simula</i> como algo que parecia querer chegar a
algo, mas ainda não sabia descrever o que era.
</p>

<p>
O conceito de orientação a objetos, como originalmente concebido, tinha como
base uma organização hierárquica originalmente vista na biologia. Poderia-se
compreender que organismos, em especial células, comportavam-se como estruturas
com comportamento interno complexo, porém opaco ao resto do sistema; o contato
da célula com o mundo exterior a ela e vice-versa era feito através de um <i>canal</i>,
que poderia ser compreendido como uma membrana externa, que filtra certas
<i>mensagens</i> e decide como as responde, e se responde-as.
</p>

<p>
Ainda tomando este modelo de estrutura opaca com um canal de comunicação externo
por mensagens, percebeu-se que, quando aplicado um contexto matemático a esta
ideia, poderia surgir uma álgebra própria onde estas estruturas poderiam ser
manipuladas, de forma que esta troca de mensagens poderia ser descrita.
</p>

<p>
Às estruturas opacas, Alan Kay deu o nome de <i>objetos</i>, e estes foram os pilares
que o fizeram começar a trabalhar na linguagem Smalltalk. Para Kay, este
conceito de <i>objetos</i> não significaria apenas estruturas em uma linguagem, mas
também formas de representar estruturas reais e criar meios de comunicação
abstrata (por exemplo, entre computadores em uma rede). A influência de
Smalltalk chegou à comunidade de (Common) Lisp e, eventualmente, surgiu o CLOS
(<i>Common Lisp Object System</i>).
</p>

<p>
Estes conceitos influenciaram na criação da linguagem C++ e de outras linguagens
que, por sua vez, possibilitaram a implementação da orientação a objetos na
indústria de hoje, o que incluiu o advento da linguagem Java. Nestas linguagens,
o principal foco está na organização de objetos como uma evolução de estruturas
de dados, contendo, internamente, campos de dados e métodos que este objeto
poderia executar, seja alterando seu próprio estado interno, seja comunicando-se
com outros objetos do contexto.
</p>

<p>
A orientação a objetos estabelecida na indústria e ensinada nas universidades
normalmente lembra a forma como classifica-se em C++ e Java, e acabou
tornando-se um assunto controverso entre os puristas e estudiosos do assunto.
</p>
</div>
</div>
<div id="outline-container-org76de6f4" class="outline-3">
<h3 id="org76de6f4">O que será feito?</h3>
<div class="outline-text-3" id="text-org76de6f4">
<p>
Neste post, pretendo mostrar implementações em Java e Common Lisp,
respectivamente, como representantes de dois modos de pensar a respeito de
orientação a objetos: Java como sendo uma vertente mais associada a C++, e
Common Lisp como uma vertente mais associada a Smalltalk. Tentaremos resolver o
seguinte problema, que é extremamente simples:
</p>

<blockquote>
<p>
Temos um certo conjunto de <i>formas</i>. Estas formas podem ser <i>círculos</i>, <i>quadrados</i> ou
<i>pentágonos</i>, todos sendo formas regulares. Cada uma das formas têm suas
peculiaridades necessárias para a sua construção, como <i>raio</i> ou <i>tamanho do
lado</i>. Gere um conjunto arbitrário de <i>formas</i>, e mostre as somas de seus
perímetros, as somas de suas áreas, e as somas do quadrado da medida do lado de
cada forma, caso seja possível.
</p>
</blockquote>
</div>
<div id="outline-container-org9fe1a5a" class="outline-4">
<h4 id="org9fe1a5a">ACHTUNG!</h4>
<div class="outline-text-4" id="text-org9fe1a5a">
<p>
O objetivo deste exercício não é destacar uma linguagem ou uma visão do
paradigma como melhor que o outro, mas sim demonstrar a diferença no raciocínio
e na produção das soluções para o problema em questão. Evidenciam-se os
contrastes semânticos, acima dos sintáticos, ainda que não sejam completamente
dissociáveis.
</p>

<p>
Obviamente, possuo minhas próprias preferências com relação às linguagens
utilizadas, mas aqui pretendo apresentar uma espécie de pedra de roseta, e
deixar que o leitor tome suas próprias conclusões com relação às visões e formas
de resolução apresentadas.
</p>

<p>
Também não há a pretensão, aqui, de gerar código com excelência de performance,
sendo o entendimento do leitor o alvo mais importante. Todavia, como Common Lisp
pode ser uma linguagem muito ortodoxa, algumas seções incluem explicações extras
acerca da aparelhagem sintática da mesma. Recomendo abusar dos <i>links</i> entre o
texto e notas de rodapé, e vice-versa.
</p>
</div>
</div>
</div>
</div>
