src/posts/oop-java-vs-cl.org
* OO do "jeito Java"

O "jeito Java" consiste na declaração de uma abstração-mor, e então
na criação de sub-abstrações, para a resolução do problema.

Temos uma abstração que determina as operações básicas de uma forma: uma
/interface/. As formas em si são abstraídas por /classes/ que implementam esta
interface.

Criamos um contêiner capaz de armazenar instâncias de classes que implementem a
interface declarada, e então poderemos iterar sobre este contêiner, para então
calcular as três operações requisitadas pelo enunciado.

** Inicialização

Um programa Java é inicializado com a declaração do pacote que conterá as
estruturas a serem utilizadas. Logo em seguida, importamos outros pacotes (ou
classes específicas em certos pacotes) que auxiliarão na implementação do nosso
programa.

#+BEGIN_SRC java
package OOPTest;

import java.util.ArrayList;
import java.lang.UnsupportedOperationException;
import java.lang.Math;
#+END_SRC

#+BEGIN_NOTES
*NOTA:* Nenhuma das estruturas a seguir será declarada com acesso público, uma vez
que o objetivo do programa é criar uma aplicação auto-contida e simples, não um
projeto formal. Esta decisão torna desnecessário declarar estas estruturas em
seus próprios arquivos.
#+END_NOTES

** Interface para as formas

Implementamos uma interface chamada ~IShape~, que descreve valores básicos, que
podem ser obtidos proceduralmente para uma forma qualquer: /perímetro/, /área/ e
/quadrado do lado/.

#+BEGIN_SRC java
interface IShape {
    float perimeter();
    float area();
    float squaredSide();
}
#+END_SRC

** Implementação das formas

Uma vez declarada a interface a ser implementada por cada forma, podemos
declarar as classes para as formas em si.

*** Círculo

A classe ~Circle~ implementa a forma de um círculo. Como atributos próprios da
classe, temos um valor decimal especificando o raio do círculo, chamado ~radius~,
e também temos um construtor para a classe, que explicita a necessidade de um
valor para o raio, ao criarmos uma instância da mesma[fn:2].

#+BEGIN_SRC java
class Circle implements IShape {
    private float radius;

    public Circle(float radius) {
        this.radius = radius;
    }

    public float perimeter() {
        return 2.0f * (float)Math.PI * this.radius;
    }

    public float area() {
        return (float)Math.PI * this.radius * this.radius;
    }

    public float squaredSide() {
        throw new UnsupportedOperationException("A circle has no sides");
    }
}
#+END_SRC

Note que, como estamos tratando de um círculo, não possuímos valor para seu
lado. Poderíamos tratar o lado como sendo o comprimento da circunferência do
mesmo, mas este seria seu perímetro; ao invés disso, vamos assumir que esta
operação é impossível, uma vez que um círculo, tecnicamente, não possui lados.

#+BEGIN_NOTES
*NOTA:* Veja que o método que implementa o quadrado do lado de um círculo levanta
 uma exceção do tipo ~UnsupportedOperationException~, com uma mensagem específica
 de erro. Esta exceção é uma forma de mostrar que a operação não é suportada por
 esta classe. Fazemos isto porque ~Circle~ implementa a interface ~IShape~, que
 obriga nossas classes a implementarem /todas/ as operações da interface.
#+END_NOTES

*** Quadrado

O quadrado é, provavelmente, a classe de mais simples implementação: todas as
suas operações são triviais, e o quadrado do seu lado é idêntico à sua área.

Internamente, armazenamos o tamanho de seu lado, e explicitamos, no construtor,
a necessidade do fornecimento deste valor para que possamos instanciar
adequadamente a classe.

#+BEGIN_SRC java
class Square implements IShape {
    private float side;
    
    public Square(float side) {
        this.side = side;
    }
    
    public float perimeter() { 
        return 4.0f * this.side;
    }
    
    public float area() { 
        return this.side * this.side;
    }
    
    public float squaredSide() { 
        return this.side * this.side;
    }
}
#+END_SRC

*** Pentágono

O pentágono possui as mesmas características do quadrado com relação ao seu
construtor, seu perímetro, e o quadrado do seu lado. Mas o cálculo da área do
pentágono é um pouco diferente.

#+BEGIN_SRC java
class Pentagon implements IShape {
    private float side;
    
    public Pentagon(float side) {
        this.side = side;
    }
    
    public float perimeter() { 
        return 5.0f * this.side;
    }

    private float apothem() {
        return (this.side / 2.0f) / (float)Math.tan(Math.toRadians(36.0f));
    }
    
    public float area() { 
        return (this.apothem() * this.perimeter()) / 2.0f;
    }
    
    public float squaredSide() { 
        return this.side * this.side;
    }
}
#+END_SRC

Como você pode perceber, temos um método a mais, com acesso /privado/, que calcula
o comprimento do /apótema/[fn:3] do pentágono. Baseado neste método, que só pode
ser acessado internamente pela classe, podemos calcular a área do pentágono,
baseada no comprimento do apótema e no seu perímetro.

