posts/oop-java-vs-cl.html
<div id="outline-container-org8e8af10" class="outline-2">
<h2 id="org8e8af10">OO do "jeito Java"</h2>
<div class="outline-text-2" id="text-org8e8af10">
<p>
O "jeito Java" consiste na declaração de uma abstração-mor, e então
na criação de sub-abstrações, para a resolução do problema.
</p>

<p>
Temos uma abstração que determina as operações básicas de uma forma: uma
<i>interface</i>. As formas em si são abstraídas por <i>classes</i> que implementam esta
interface.
</p>

<p>
Criamos um contêiner capaz de armazenar instâncias de classes que implementem a
interface declarada, e então poderemos iterar sobre este contêiner, para então
calcular as três operações requisitadas pelo enunciado.
</p>
</div>
<div id="outline-container-org0919b9b" class="outline-3">
<h3 id="org0919b9b">Inicialização</h3>
<div class="outline-text-3" id="text-org0919b9b">
<p>
Um programa Java é inicializado com a declaração do pacote que conterá as
estruturas a serem utilizadas. Logo em seguida, importamos outros pacotes (ou
classes específicas em certos pacotes) que auxiliarão na implementação do nosso
programa.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> <span class="org-constant">OOPTest</span>;

<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">ArrayList</span>;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">lang</span>.<span class="org-type">UnsupportedOperationException</span>;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">lang</span>.<span class="org-type">Math</span>;
</pre>
</div>

<div class="NOTES" id="orgc632365">
<p>
<b>NOTA:</b> Nenhuma das estruturas a seguir será declarada com acesso público, uma vez
que o objetivo do programa é criar uma aplicação auto-contida e simples, não um
projeto formal. Esta decisão torna desnecessário declarar estas estruturas em
seus próprios arquivos.
</p>

</div>
</div>
</div>
<div id="outline-container-orgf2fbf70" class="outline-3">
<h3 id="orgf2fbf70">Interface para as formas</h3>
<div class="outline-text-3" id="text-orgf2fbf70">
<p>
Implementamos uma interface chamada <code>IShape</code>, que descreve valores básicos, que
podem ser obtidos proceduralmente para uma forma qualquer: <i>perímetro</i>, <i>área</i> e
<i>quadrado do lado</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">interface</span> <span class="org-type">IShape</span> {
    <span class="org-type">float</span> <span class="org-function-name">perimeter</span>();
    <span class="org-type">float</span> <span class="org-function-name">area</span>();
    <span class="org-type">float</span> <span class="org-function-name">squaredSide</span>();
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org789a60a" class="outline-3">
<h3 id="org789a60a">Implementação das formas</h3>
<div class="outline-text-3" id="text-org789a60a">
<p>
Uma vez declarada a interface a ser implementada por cada forma, podemos
declarar as classes para as formas em si.
</p>
</div>
<div id="outline-container-orgde65120" class="outline-4">
<h4 id="orgde65120">Círculo</h4>
<div class="outline-text-4" id="text-orgde65120">
<p>
A classe <code>Circle</code> implementa a forma de um círculo. Como atributos próprios da
classe, temos um valor decimal especificando o raio do círculo, chamado <code>radius</code>,
e também temos um construtor para a classe, que explicita a necessidade de um
valor para o raio, ao criarmos uma instância da mesma<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">Circle</span> <span class="org-keyword">implements</span> <span class="org-type">IShape</span> {
    <span class="org-keyword">private</span> <span class="org-type">float</span> <span class="org-variable-name">radius</span>;

    <span class="org-keyword">public</span> <span class="org-function-name">Circle</span>(<span class="org-type">float</span> <span class="org-variable-name">radius</span>) {
        <span class="org-keyword">this</span>.radius = radius;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">perimeter</span>() {
        <span class="org-keyword">return</span> 2.0f * (<span class="org-type">float</span>)<span class="org-constant">Math</span>.PI * <span class="org-keyword">this</span>.radius;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">area</span>() {
        <span class="org-keyword">return</span> (<span class="org-type">float</span>)<span class="org-constant">Math</span>.PI * <span class="org-keyword">this</span>.radius * <span class="org-keyword">this</span>.radius;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">squaredSide</span>() {
        <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">UnsupportedOperationException</span>(<span class="org-string">"A circle has no sides"</span>);
    }
}
</pre>
</div>

<p>
Note que, como estamos tratando de um círculo, não possuímos valor para seu
lado. Poderíamos tratar o lado como sendo o comprimento da circunferência do
mesmo, mas este seria seu perímetro; ao invés disso, vamos assumir que esta
operação é impossível, uma vez que um círculo, tecnicamente, não possui lados.
</p>

<div class="NOTES" id="orgbc70752">
<p>
<b>NOTA:</b> Veja que o método que implementa o quadrado do lado de um círculo levanta
 uma exceção do tipo <code>UnsupportedOperationException</code>, com uma mensagem específica
 de erro. Esta exceção é uma forma de mostrar que a operação não é suportada por
 esta classe. Fazemos isto porque <code>Circle</code> implementa a interface <code>IShape</code>, que
 obriga nossas classes a implementarem <i>todas</i> as operações da interface.
</p>

</div>
</div>
</div>
<div id="outline-container-orgbaca00a" class="outline-4">
<h4 id="orgbaca00a">Quadrado</h4>
<div class="outline-text-4" id="text-orgbaca00a">
<p>
O quadrado é, provavelmente, a classe de mais simples implementação: todas as
suas operações são triviais, e o quadrado do seu lado é idêntico à sua área.
</p>

<p>
Internamente, armazenamos o tamanho de seu lado, e explicitamos, no construtor,
a necessidade do fornecimento deste valor para que possamos instanciar
adequadamente a classe.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">Square</span> <span class="org-keyword">implements</span> <span class="org-type">IShape</span> {
    <span class="org-keyword">private</span> <span class="org-type">float</span> <span class="org-variable-name">side</span>;

    <span class="org-keyword">public</span> <span class="org-function-name">Square</span>(<span class="org-type">float</span> <span class="org-variable-name">side</span>) {
        <span class="org-keyword">this</span>.side = side;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">perimeter</span>() { 
        <span class="org-keyword">return</span> 4.0f * <span class="org-keyword">this</span>.side;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">area</span>() { 
        <span class="org-keyword">return</span> <span class="org-keyword">this</span>.side * <span class="org-keyword">this</span>.side;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">squaredSide</span>() { 
        <span class="org-keyword">return</span> <span class="org-keyword">this</span>.side * <span class="org-keyword">this</span>.side;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3edb0cf" class="outline-4">
<h4 id="org3edb0cf">Pentágono</h4>
<div class="outline-text-4" id="text-org3edb0cf">
<p>
O pentágono possui as mesmas características do quadrado com relação ao seu
construtor, seu perímetro, e o quadrado do seu lado. Mas o cálculo da área do
pentágono é um pouco diferente.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">Pentagon</span> <span class="org-keyword">implements</span> <span class="org-type">IShape</span> {
    <span class="org-keyword">private</span> <span class="org-type">float</span> <span class="org-variable-name">side</span>;

    <span class="org-keyword">public</span> <span class="org-function-name">Pentagon</span>(<span class="org-type">float</span> <span class="org-variable-name">side</span>) {
        <span class="org-keyword">this</span>.side = side;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">perimeter</span>() { 
        <span class="org-keyword">return</span> 5.0f * <span class="org-keyword">this</span>.side;
    }

    <span class="org-keyword">private</span> <span class="org-type">float</span> <span class="org-function-name">apothem</span>() {
        <span class="org-keyword">return</span> (<span class="org-keyword">this</span>.side / 2.0f) / (<span class="org-type">float</span>)Math.tan(Math.toRadians(36.0f));
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">area</span>() { 
        <span class="org-keyword">return</span> (<span class="org-keyword">this</span>.apothem() * <span class="org-keyword">this</span>.perimeter()) / 2.0f;
    }

    <span class="org-keyword">public</span> <span class="org-type">float</span> <span class="org-function-name">squaredSide</span>() { 
        <span class="org-keyword">return</span> <span class="org-keyword">this</span>.side * <span class="org-keyword">this</span>.side;
    }
}
</pre>
</div>

<p>
Como você pode perceber, temos um método a mais, com acesso <i>privado</i>, que calcula
o comprimento do <i>apótema</i><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup> do pentágono. Baseado neste método, que só pode
ser acessado internamente pela classe, podemos calcular a área do pentágono,
baseada no comprimento do apótema e no seu perímetro.
</p>
</div>
</div>
</div>
