src/posts/oop-java-vs-cl.org
** Utilitários

A geração de uma quantidade arbitrária de formas e o cálculo das operações (soma
dos perímetros, soma das áreas, soma dos quadrados dos lados) são encapsulados
como métodos estáticos de uma classe ~Utility~, para melhor
compartimentalização. A implementação destas operações é bem evidente, com
exceção da implementação da soma dos quadrados dos lados.

As formas em questão são armazenadas em um ~ArrayList~, que será então repassado
aos métodos de cálculo em questão.

Outra informação relevante é que, pelo fato de estes métodos serem estáticos,
não é necessário instanciarmos esta classe para utilizá-los. Uma chamada
conveniente a ~Utility.nomeDoMetodo(...)~ é o suficiente para seus usos.

#+BEGIN_SRC java
class Utility {
    public static ArrayList<IShape> makeShapes(int numShapes) {
        ArrayList<IShape> arr = new ArrayList<IShape>();
        for(int i = 1; i <= (int)(numShapes / 3); i++) {
            arr.add(new Circle(i));
            arr.add(new Square(i));
            arr.add(new Pentagon(i));
        }
        return arr;
    }

    public static float sumOfPerimeters(ArrayList<IShape> arr) {
        float sum = 0.0f;
        for(IShape s : arr) {
            sum += s.perimeter();
        }
        return sum;
    }

    public static float sumOfAreas(ArrayList<IShape> arr) {
        float sum = 0.0f;
        for(IShape s : arr) {
            sum += s.area();
        }
        return sum;
    }

    public static float sumOfSquaredSides(ArrayList<IShape> arr) {
        float sum = 0.0f;
        for(IShape s : arr) {
            try {
                sum += s.squaredSide();
            } catch(UnsupportedOperationException e) {
                /* ... */
            }
        }
        return sum;
    }
}
#+END_SRC

Para a operação da soma dos quadrados dos lados, iteramos sobre o nosso
contêiner de formas. Porém, se a forma atual em questão for um círculo, sabemos
que este levantará uma exceção de ~UnsupportedOperationException~. Para evitar que
isto signifique a interrupção do nosso programa, encapsulamos a tentativa de
contabilização do quadrado do lado da forma atual em um bloco ~try-catch~. Este
bloco /trata a exceção/, executando o bloco ~catch~ caso ela seja levantada.

Neste exemplo, caso a exceção em questão seja levantada, a contabilização do
quadrado do lado para a forma atual será apenas ignorada.

** Ponto de entrada do programa

Enfim, podemos executar nosso programa. Para tanto, precisamos de mais uma
classe, que aqui chamamos ~Program~, com um método estático chamado ~main~. Aqui,
criamos dez formas, e então imprimimos cada uma das operações, baseadas no
conjunto de dez formas que criamos arbitrariamente.

#+BEGIN_SRC java
class Program {
    public static void main(String[] args) {
        ArrayList<IShape> shapes = Utility.makeShapes(10);
        System.out.println("Sum of Perimeters: "
                + Utility.sumOfPerimeters(shapes));
        System.out.println("Sum of Areas: " + Utility.sumOfAreas(shapes));
        System.out.println("Sum of Squared Sides: "
                + Utility.sumOfSquaredSides(shapes));
    }
}
#+END_SRC

* OO do "jeito Common Lisp"

O "jeito Common Lisp" consiste no uso da forma "original" de orientação a
objetos, mencionada anteriormente.

Esta forma de orientação a objetos lembra o funcionamento de Smalltalk, e é
tratada, por alguns autores, como uma boa interpretação da orientação a objetos,
ao ser implementada em uma linguagem de programação[fn:4].

O /Common Lisp Object System/ foi criado muito depois da concepção da linguagem
Lisp original, sendo originalmente uma extensão de Common Lisp, que
posteriormente viria a ser incluída na especificação da linguagem[fn:5].

** Inicialização

Primeiramente, vamos iniciar nosso projeto através da criação de um pacote em
Common Lisp. Aqui estarei utilizando, também, o /system/ ~iterate~, que substitui o
uso do macro ~loop~ na linguagem[fn:6].

#+BEGIN_SRC lisp
(ql:quickload :iterate)

(defpackage :oop-test
  (:use #:cl #:iterate))
#+END_SRC

Common Lisp exige que exportemos certos símbolos, caso precisemos utilizá-los em
outros pacotes. O /environment/ de Common Lisp é inicializado no "pacote" ~cl-user~
(ou ~common-lisp-user~). Como este é apenas um teste de propósito geral, podemos
adentrar o pacote e definir símbolos logo dentro dele.

#+BEGIN_SRC lisp
(in-package :oop-test)
#+END_SRC

#+BEGIN_NOTES
*NOTA:* Caso você já possua o arquivo de código deste programa e esteja
simplesmente tentando revisitar o que foi feito neste pacote, basta executar a
linha acima no seu REPL, após dar ~(load "arquivo.lisp")~. Não entrarei aqui em
pormenores da modularização de Common Lisp, por acreditar que isto seria melhor
endereçado em um post sobre Quicklisp, Quickproject, ASDF, /systems/ e /packages/,
que posso vir a fazer no futuro.
#+END_NOTES

