posts/oop-java-vs-cl.html
<div id="outline-container-orgd337f94" class="outline-3">
<h3 id="orgd337f94">Utilitários</h3>
<div class="outline-text-3" id="text-orgd337f94">
<p>
A geração de uma quantidade arbitrária de formas e o cálculo das operações (soma
dos perímetros, soma das áreas, soma dos quadrados dos lados) são encapsulados
como métodos estáticos de uma classe <code>Utility</code>, para melhor
compartimentalização. A implementação destas operações é bem evidente, com
exceção da implementação da soma dos quadrados dos lados.
</p>

<p>
As formas em questão são armazenadas em um <code>ArrayList</code>, que será então repassado
aos métodos de cálculo em questão.
</p>

<p>
Outra informação relevante é que, pelo fato de estes métodos serem estáticos,
não é necessário instanciarmos esta classe para utilizá-los. Uma chamada
conveniente a <code>Utility.nomeDoMetodo(...)</code> é o suficiente para seus usos.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">Utility</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt; <span class="org-function-name">makeShapes</span>(<span class="org-type">int</span> <span class="org-variable-name">numShapes</span>) {
        <span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt; <span class="org-variable-name">arr</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt;();
        <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 1; i &lt;= (<span class="org-type">int</span>)(numShapes / 3); i++) {
            arr.add(<span class="org-keyword">new</span> <span class="org-type">Circle</span>(i));
            arr.add(<span class="org-keyword">new</span> <span class="org-type">Square</span>(i));
            arr.add(<span class="org-keyword">new</span> <span class="org-type">Pentagon</span>(i));
        }
        <span class="org-keyword">return</span> arr;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">float</span> <span class="org-function-name">sumOfPerimeters</span>(<span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt; <span class="org-variable-name">arr</span>) {
        <span class="org-type">float</span> <span class="org-variable-name">sum</span> = 0.0f;
        <span class="org-keyword">for</span>(<span class="org-type">IShape</span> <span class="org-variable-name">s</span> : arr) {
            sum += s.perimeter();
        }
        <span class="org-keyword">return</span> sum;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">float</span> <span class="org-function-name">sumOfAreas</span>(<span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt; <span class="org-variable-name">arr</span>) {
        <span class="org-type">float</span> <span class="org-variable-name">sum</span> = 0.0f;
        <span class="org-keyword">for</span>(<span class="org-type">IShape</span> <span class="org-variable-name">s</span> : arr) {
            sum += s.area();
        }
        <span class="org-keyword">return</span> sum;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">float</span> <span class="org-function-name">sumOfSquaredSides</span>(<span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt; <span class="org-variable-name">arr</span>) {
        <span class="org-type">float</span> <span class="org-variable-name">sum</span> = 0.0f;
        <span class="org-keyword">for</span>(<span class="org-type">IShape</span> <span class="org-variable-name">s</span> : arr) {
            <span class="org-keyword">try</span> {
                sum += s.squaredSide();
            } <span class="org-keyword">catch</span>(UnsupportedOperationException e) {
                <span class="org-comment-delimiter">/* </span><span class="org-comment">...</span><span class="org-comment-delimiter"> */</span>
            }
        }
        <span class="org-keyword">return</span> sum;
    }
}
</pre>
</div>

<p>
Para a operação da soma dos quadrados dos lados, iteramos sobre o nosso
contêiner de formas. Porém, se a forma atual em questão for um círculo, sabemos
que este levantará uma exceção de <code>UnsupportedOperationException</code>. Para evitar que
isto signifique a interrupção do nosso programa, encapsulamos a tentativa de
contabilização do quadrado do lado da forma atual em um bloco <code>try-catch</code>. Este
bloco <i>trata a exceção</i>, executando o bloco <code>catch</code> caso ela seja levantada.
</p>

<p>
Neste exemplo, caso a exceção em questão seja levantada, a contabilização do
quadrado do lado para a forma atual será apenas ignorada.
</p>
</div>
</div>
<div id="outline-container-org5c5632f" class="outline-3">
<h3 id="org5c5632f">Ponto de entrada do programa</h3>
<div class="outline-text-3" id="text-org5c5632f">
<p>
Enfim, podemos executar nosso programa. Para tanto, precisamos de mais uma
classe, que aqui chamamos <code>Program</code>, com um método estático chamado <code>main</code>. Aqui,
criamos dez formas, e então imprimimos cada uma das operações, baseadas no
conjunto de dez formas que criamos arbitrariamente.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">Program</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">ArrayList</span>&lt;<span class="org-type">IShape</span>&gt; <span class="org-variable-name">shapes</span> = Utility.makeShapes(10);
        System.out.println(<span class="org-string">"Sum of Perimeters: "</span>
                + Utility.sumOfPerimeters(shapes));
        System.out.println(<span class="org-string">"Sum of Areas: "</span> + Utility.sumOfAreas(shapes));
        System.out.println(<span class="org-string">"Sum of Squared Sides: "</span>
                + Utility.sumOfSquaredSides(shapes));
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org44db247" class="outline-2">
<h2 id="org44db247">OO do "jeito Common Lisp"</h2>
<div class="outline-text-2" id="text-org44db247">
<p>
O "jeito Common Lisp" consiste no uso da forma "original" de orientação a
objetos, mencionada anteriormente.
</p>

<p>
Esta forma de orientação a objetos lembra o funcionamento de Smalltalk, e é
tratada, por alguns autores, como uma boa interpretação da orientação a objetos,
ao ser implementada em uma linguagem de programação<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>.
</p>

<p>
O <i>Common Lisp Object System</i> foi criado muito depois da concepção da linguagem
Lisp original, sendo originalmente uma extensão de Common Lisp, que
posteriormente viria a ser incluída na especificação da linguagem<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>.
</p>
</div>
<div id="outline-container-org4b255df" class="outline-3">
<h3 id="org4b255df">Inicialização</h3>
<div class="outline-text-3" id="text-org4b255df">
<p>
Primeiramente, vamos iniciar nosso projeto através da criação de um pacote em
Common Lisp. Aqui estarei utilizando, também, o <i>system</i> <code>iterate</code>, que substitui o
uso do macro <code>loop</code> na linguagem<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span class="org-builtin">:iterate</span>)

(<span class="org-keyword">defpackage</span> <span class="org-type">:oop-test</span>
  (<span class="org-builtin">:use</span> <span class="org-builtin">#:cl</span> <span class="org-builtin">#:iterate</span>))
</pre>
</div>

<p>
Common Lisp exige que exportemos certos símbolos, caso precisemos utilizá-los em
outros pacotes. O <i>environment</i> de Common Lisp é inicializado no "pacote" <code>cl-user</code>
(ou <code>common-lisp-user</code>). Como este é apenas um teste de propósito geral, podemos
adentrar o pacote e definir símbolos logo dentro dele.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:oop-test</span>)
</pre>
</div>

<div class="NOTES" id="org229ee59">
<p>
<b>NOTA:</b> Caso você já possua o arquivo de código deste programa e esteja
simplesmente tentando revisitar o que foi feito neste pacote, basta executar a
linha acima no seu REPL, após dar <code>(load "arquivo.lisp")</code>. Não entrarei aqui em
pormenores da modularização de Common Lisp, por acreditar que isto seria melhor
endereçado em um post sobre Quicklisp, Quickproject, ASDF, <i>systems</i> e <i>packages</i>,
que posso vir a fazer no futuro.
</p>

</div>
</div>
</div>
