src/posts/oop-java-vs-cl.org
** Operações genéricas

Baseado no que foi dito na introdução, precisamos de um vocabulário inicial
de mensagens que podemos passar para alguns objetos, como uma espécie de lista
de comandos gerais.

#+BEGIN_SRC lisp
(defgeneric perimeter (shape)
  (:documentation "Calculates perimeter of a shape."))

(defgeneric area (shape)
  (:documentation "Calculates area of a shape."))

(defgeneric squared-side (shape)
  (:documentation "Squares the side value of a regular shape."))
#+END_SRC

Aproveitamos, também, para utilizar o suporte da linguagem a /docstrings/ para
criar documentação mínima para nossas operações genéricas. Isto poderia ser
útil, caso esquecêssemos do que cada uma destas mensagens poderia requisitar.

Perceba que o uso do átomo ~shape~ como aparente argumento destas operações
genéricas é completamente arbitrário, apesar de possuir carga semântica para o
programador. Em outras palavras, Common Lisp não possui exigência sobre a
natureza dos símbolos utilizados em argumentos de /generics/; eles só estão lá
para "marcar lugares" de argumentos em métodos -- isto será entendido logo mais.

** Classes

Em CLOS, classes são definidas a partir de duas coisas: uma lista de
superclasses das quais derivam, e uma lista de /slots/, cada qual com suas
propriedades. Aqui não teremos nenhuma superclasse para derivar, mas temos três
classes, cada qual com um slot relevante.

#+BEGIN_SRC lisp
(defclass circle ()
  ((%radius :initarg :radius
            :reader radius)))

(defclass square ()
  ((%side :initarg :side
          :reader side)))

(defclass pentagon ()
  ((%side :initarg :side
          :reader side)))
#+END_SRC

A classe ~circle~ define nosso círculo. Temos um /slot/ chamado ~%radius~, que
armazenará o raio do nosso círculo.

O mesmo vale para o /slot/ ~%side~ de ~square~ e ~pentagon~, que representa o tamanho do
lado destas formas.

Veja que definimos duas propriedades extras para cada /slot/. A primeira é o
~initarg~; a segunda, um ~reader~. O ~initarg~ representa o átomo que simboliza a
chave para definir o valor para aquele /slot/, durante o instanciamento da
classe[fn:7].

Já o ~reader~ é a definição rápida de uma forma de realizar a leitura daquele
/slot/, em outros cantos do código. Ele será necessário para que possamos,
efetivamente, recuperar os dados da instância. No caso de ~circle~, o raio
de um círculo poderá ser recuperado de uma instância com ~(radius
instancia)~. Situações similares ocorrerão para os lados de ~square~ e
~pentagon~[fn:8].

** Métodos

/Métodos/, em Common Lisp, nada mais são que especificações das /operações
genéricas/.[fn:9] Ao definirmos o método, normalmente teremos um ou mais
parâmetros na lista de parâmetros que determinam a forma como a operação será
despachada, de acordo com o objeto passado por parâmetro.

Por exemplo, um argumento de assinatura ~(variavel nome-da-classe)~ implica que
aquele método possui implementação para a classe ~nome-da-classe~ e, portanto,
~variavel~ terá uma mensagem a retornar mediante a invocação do método em
questão[fn:10].

Realizaremos a implementação dos métodos por mensagem, ao invés de
implementarmos todos os métodos para cada classe, por vez.

*** Perímetro

A implementação das operações de perímetro são simples. A passagem da mensagem
~perimeter~ para cada uma das instâncias das três classes realizará o despacho
para o método relativo ao tipo da classe.

#+BEGIN_SRC lisp
(defmethod perimeter ((s circle))
  (* 2 pi (radius s)))


(defmethod perimeter ((s square))
  (* 4 (side s)))


(defmethod perimeter ((s pentagon))
  (* 5 (side s)))
#+END_SRC

*** Área

O cálculo da área para um círculo e um quadrado também não é diferente, nem
envolve complexidade extra alguma.

#+BEGIN_SRC lisp
(defmethod area ((s circle))
  (* pi (radius s) (radius s)))


(defmethod area ((s square))
  (* (side s) (side s)))
#+END_SRC

Todavia, sabemos que teremos complexidade extra ao calcular a área de um
pentágono. Vamos nos preparar para isto, definindo um /macro/[fn:11] que converte
um ângulo em graus para radianos.

#+BEGIN_SRC lisp
(defmacro deg->rad (angle-in-degrees)
  `(/ (* ,angle-in-degrees pi) 180))
#+END_SRC

Podemos, agora, definir a forma de se calcular a área de um pentágono. Começamos
definindo uma função aninhada ao método[fn:12], que calcula o
apótema. Utilizando esta função aninhada, e baseando-nos no cálculo do apótema e
do perímetro do pentágono, calculamos a área.

#+BEGIN_SRC lisp
(defmethod area ((s pentagon))
  (labels ((apothem (s)
             (/ (/ (side s) 2)
                (tan (deg->rad 36)))))
    (/ (* (apothem s)
          (perimeter s))
       2)))
#+END_SRC

*** Quadrado do lado

Aqui, definimos o cálculo do quadrado dos lados para o quadrado e para o
pentágono. *Note que, no caso do círculo, simplesmente não definimos o método*.

#+BEGIN_SRC lisp
(defmethod squared-side ((s square))
  (* (side s) (side s)))


(defmethod squared-side ((s pentagon))
  (* (side s) (side s)))
#+END_SRC

