posts/oop-java-vs-cl.html
<div id="outline-container-org81d215d" class="outline-3">
<h3 id="org81d215d">Operações genéricas</h3>
<div class="outline-text-3" id="text-org81d215d">
<p>
Baseado no que foi dito na introdução, precisamos de um vocabulário inicial
de mensagens que podemos passar para alguns objetos, como uma espécie de lista
de comandos gerais.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defgeneric</span> <span class="org-function-name">perimeter</span> (shape)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Calculates perimeter of a shape."</span>))

(<span class="org-keyword">defgeneric</span> <span class="org-function-name">area</span> (shape)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Calculates area of a shape."</span>))

(<span class="org-keyword">defgeneric</span> <span class="org-function-name">squared-side</span> (shape)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Squares the side value of a regular shape."</span>))
</pre>
</div>

<p>
Aproveitamos, também, para utilizar o suporte da linguagem a <i>docstrings</i> para
criar documentação mínima para nossas operações genéricas. Isto poderia ser
útil, caso esquecêssemos do que cada uma destas mensagens poderia requisitar.
</p>

<p>
Perceba que o uso do átomo <code>shape</code> como aparente argumento destas operações
genéricas é completamente arbitrário, apesar de possuir carga semântica para o
programador. Em outras palavras, Common Lisp não possui exigência sobre a
natureza dos símbolos utilizados em argumentos de <i>generics</i>; eles só estão lá
para "marcar lugares" de argumentos em métodos &#x2013; isto será entendido logo mais.
</p>
</div>
</div>
<div id="outline-container-orgdb3711b" class="outline-3">
<h3 id="orgdb3711b">Classes</h3>
<div class="outline-text-3" id="text-orgdb3711b">
<p>
Em CLOS, classes são definidas a partir de duas coisas: uma lista de
superclasses das quais derivam, e uma lista de <i>slots</i>, cada qual com suas
propriedades. Aqui não teremos nenhuma superclasse para derivar, mas temos três
classes, cada qual com um slot relevante.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defclass</span> <span class="org-type">circle</span> ()
  ((%radius <span class="org-builtin">:initarg</span> <span class="org-builtin">:radius</span>
            <span class="org-builtin">:reader</span> radius)))

(<span class="org-keyword">defclass</span> <span class="org-type">square</span> ()
  ((%side <span class="org-builtin">:initarg</span> <span class="org-builtin">:side</span>
          <span class="org-builtin">:reader</span> side)))

(<span class="org-keyword">defclass</span> <span class="org-type">pentagon</span> ()
  ((%side <span class="org-builtin">:initarg</span> <span class="org-builtin">:side</span>
          <span class="org-builtin">:reader</span> side)))
</pre>
</div>

<p>
A classe <code>circle</code> define nosso círculo. Temos um <i>slot</i> chamado <code>%radius</code>, que
armazenará o raio do nosso círculo.
</p>

<p>
O mesmo vale para o <i>slot</i> <code>%side</code> de <code>square</code> e <code>pentagon</code>, que representa o tamanho do
lado destas formas.
</p>

<p>
Veja que definimos duas propriedades extras para cada <i>slot</i>. A primeira é o
<code>initarg</code>; a segunda, um <code>reader</code>. O <code>initarg</code> representa o átomo que simboliza a
chave para definir o valor para aquele <i>slot</i>, durante o instanciamento da
classe<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>.
</p>

<p>
Já o <code>reader</code> é a definição rápida de uma forma de realizar a leitura daquele
<i>slot</i>, em outros cantos do código. Ele será necessário para que possamos,
efetivamente, recuperar os dados da instância. No caso de <code>circle</code>, o raio
de um círculo poderá ser recuperado de uma instância com <code>(radius
instancia)</code>. Situações similares ocorrerão para os lados de <code>square</code> e
<code>pentagon</code><sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>.
</p>
</div>
</div>
<div id="outline-container-org3abe5e1" class="outline-3">
<h3 id="org3abe5e1">Métodos</h3>
<div class="outline-text-3" id="text-org3abe5e1">
<p>
<i>Métodos</i>, em Common Lisp, nada mais são que especificações das <i>operações
genéricas</i>.<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup> Ao definirmos o método, normalmente teremos um ou mais
parâmetros na lista de parâmetros que determinam a forma como a operação será
despachada, de acordo com o objeto passado por parâmetro.
</p>

<p>
Por exemplo, um argumento de assinatura <code>(variavel nome-da-classe)</code> implica que
aquele método possui implementação para a classe <code>nome-da-classe</code> e, portanto,
<code>variavel</code> terá uma mensagem a retornar mediante a invocação do método em
questão<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>.
</p>

<p>
Realizaremos a implementação dos métodos por mensagem, ao invés de
implementarmos todos os métodos para cada classe, por vez.
</p>
</div>
<div id="outline-container-org25229df" class="outline-4">
<h4 id="org25229df">Perímetro</h4>
<div class="outline-text-4" id="text-org25229df">
<p>
A implementação das operações de perímetro são simples. A passagem da mensagem
<code>perimeter</code> para cada uma das instâncias das três classes realizará o despacho
para o método relativo ao tipo da classe.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defmethod</span> <span class="org-function-name">perimeter</span> ((s circle))
  (* 2 pi (radius s)))


(<span class="org-keyword">defmethod</span> <span class="org-function-name">perimeter</span> ((s square))
  (* 4 (side s)))


(<span class="org-keyword">defmethod</span> <span class="org-function-name">perimeter</span> ((s pentagon))
  (* 5 (side s)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org48ca923" class="outline-4">
<h4 id="org48ca923">Área</h4>
<div class="outline-text-4" id="text-org48ca923">
<p>
O cálculo da área para um círculo e um quadrado também não é diferente, nem
envolve complexidade extra alguma.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defmethod</span> <span class="org-function-name">area</span> ((s circle))
  (* pi (radius s) (radius s)))


(<span class="org-keyword">defmethod</span> <span class="org-function-name">area</span> ((s square))
  (* (side s) (side s)))
</pre>
</div>

<p>
Todavia, sabemos que teremos complexidade extra ao calcular a área de um
pentágono. Vamos nos preparar para isto, definindo um <i>macro</i><sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup> que converte
um ângulo em graus para radianos.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defmacro</span> <span class="org-function-name">deg-&gt;rad</span> (angle-in-degrees)
  `(/ (* ,angle-in-degrees pi) 180))
</pre>
</div>

<p>
Podemos, agora, definir a forma de se calcular a área de um pentágono. Começamos
definindo uma função aninhada ao método<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>, que calcula o
apótema. Utilizando esta função aninhada, e baseando-nos no cálculo do apótema e
do perímetro do pentágono, calculamos a área.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defmethod</span> <span class="org-function-name">area</span> ((s pentagon))
  (<span class="org-keyword">labels</span> ((apothem (s)
             (/ (/ (side s) 2)
                (tan (deg-&gt;rad 36)))))
    (/ (* (apothem s)
          (perimeter s))
       2)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5e93e40" class="outline-4">
<h4 id="org5e93e40">Quadrado do lado</h4>
<div class="outline-text-4" id="text-org5e93e40">
<p>
Aqui, definimos o cálculo do quadrado dos lados para o quadrado e para o
pentágono. <b>Note que, no caso do círculo, simplesmente não definimos o método</b>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defmethod</span> <span class="org-function-name">squared-side</span> ((s square))
  (* (side s) (side s)))


(<span class="org-keyword">defmethod</span> <span class="org-function-name">squared-side</span> ((s pentagon))
  (* (side s) (side s)))
</pre>
</div>
</div>
</div>
</div>
