src/posts/oop-java-vs-cl.org
** Utilitários

Da mesma forma como fizemos no "jeito" anterior, definiremos alguns
procedimentos como utilitários, tanto para gerar nosso contêiner de instâncias
como para gerar nossas operações.

As instâncias, seja lá quais forem, serão armazenadas em uma lista. O /form/
~collect~, no /macro/ ~iter~, garante que cada uma das instâncias geradas sejam
incorporadas ao fim da lista. Enquanto isso, ~make-instance~ demonstra como
podemos instanciar uma classe qualquer (veja a utilização das chaves previamente
definidas nos ~:initarg~ dos /slots/ de cada classe).

#+BEGIN_SRC lisp
(defun make-shapes (num-shapes)
  (iter (for x from 1 to (/ num-shapes 3))
        (collect (make-instance 'circle   :radius x))
        (collect (make-instance 'square   :side x))
        (collect (make-instance 'pentagon :side x))))

(defun sum-of-perimeters (list)
  (iter (for elt in list)
        (sum (perimeter elt))))

(defun sum-of-areas (list)
  (iter (for elt in list)
        (sum (area elt))))
#+END_SRC

*** Soma dos quadrados dos lados

Temos um pequeno problema ao calcularmos as somas dos quadrados dos lados:
alguns de nossos objetos (mais especificamente, aqueles que sejam instâncias de
~circle~) não implementam o método ~squared-side~. Como proceder?

Há diversas formas de fazer isto. Podemos implementar um método a ser chamado
para toda e qualquer mensagem enviada a ~circle,~ que não tenha uma resposta
definida; mas não abordaremos isto aqui. Outra forma seria /tratar a condição
sinalizada/ quando o método não está implementado para o objeto[fn:13].

Mas faremos isto de forma ainda mais simples, para manter o código mais sucinto.

Lembra-se da definição da nossa operação genérica ~squared-side~? Pois bem, Common
Lisp é uma linguagem que permite a reescrita e a recompilação de certos "blocos"
de código, mesmo enquanto o programa continua sendo executado. Podemos tanto
escrever uma nova definição para ~squared-side~ quanto editar diretamente a
definição inicial e recompilá-la, caso estivéssemos utilizando uma IDE de Common
Lisp.

Nesta nova definição da operação genérica, temos um /form/ extra ao fim,
começado com ~:method~, que define a *implementação padrão* do método para quaisquer
classes que não possuam implementação para ele. Como queremos que círculos
passem a não influenciar na soma, podemos criar, neste /form/, um método que
simplesmente retorna o valor ~0~.

#+BEGIN_SRC lisp
(defgeneric squared-side (shape)
  (:documentation "Squares the side value of a regular shape.")
  (:method (obj) 0))
#+END_SRC

Depois disso, basta implementar a função de soma dos quadrados dos lados, como
se absolutamente nenhuma inconsistência pudesse acontecer antes.

#+BEGIN_SRC lisp
(defun sum-of-squared-sides (list)
  (iter (for elt in list)
        (sum (squared-side elt))))
#+END_SRC


** Função principal para testes

Definamos uma função qualquer, incumbida de gerar nossa sequência de dez formas,
e então imprimir os resultados das operações na tela. O uso do nome ~main~ aqui é
arbitrário, podendo ser substituído por qualquer outra coisa.

#+BEGIN_SRC lisp
(defun main ()
  (let ((shapes (make-shapes 10)))
    (format t "Sum of Perimeters: ~a~%"
	    (sum-of-perimeters shapes))
    (format t "Sum of Areas: ~a~%" (sum-of-areas shapes))
    (format t "Sum of Squared Sides: ~a~%"
	    (sum-of-squared-sides shapes))))
#+END_SRC

* Conclusão

Chegamos ao fim de ambas as implementações do mesmo problema. Possuimos duas
formas de resolução, sob o que outrora seria o mesmo paradigma, porém estas duas
formas mostraram-se bem diferentes.

** Comparação

Podemos montar um pequeno quadro, destacando as partes mais relevantes das
implementações e estabelecendo um paralelo entre elas.

| /Feature/                          | Java                       | Common Lisp                |
|----------------------------------+----------------------------+----------------------------|
| Abrangência da OO                | Obrigatória                | Suportada                  |
| Dados internos do objeto         | Campos privados            | /Slots/                      |
| Modelagem genérica               | Interface                  | /Generics/                   |
| Implementação do modelo genérico | Total                      | Parcial                    |
| Localização dos métodos          | Na definição da classe     | No pacote ou no /top level/  |
| Abstração mental do método       | Ação relacionada ao objeto | Mensagem passada ao objeto |

Neste momento, peço que pause e pondere a respeito do que apresentei neste
artigo. Veja se meu paralelo parece fazer sentido, se você notou mais alguma
diferença (ou se não notou diferença alguma).

Independente do conceito visto como melhor por você, leitor, lembre-se de que
situações específicas exigem ferramentas específicas.

** /Tangling/ dos arquivos

#+TODO: Linkar código fonte
Como este artigo foi escrito no Emacs, em ~org-mode~, você poderá obter o código
do mesmo a seguir. Os arquivos das linguagens Java e Common Lisp,
contendo o código-fonte em si, poderão ser obtidos ao colocar-se o
cursor sobre o bloco de código a seguir, e utilizando o atalho ~C-c C-c~:

#+BEGIN_SRC emacs-lisp :eval yes :exports code
(org-babel-tangle)
#+END_SRC

#+RESULTS:
| oop-java-vs-cl.java | oop-java-vs-cl.lisp |

#+HTML: <a href="./oop-java-vs-cl.org">Clique aqui para ir para o código-fonte.</a>

** Licenciamento

Todo e qualquer código descrito aqui é disponibilizado sob a licença BSD
2-Clause. Para mais informação, veja [[https://opensource.org/licenses/BSD-2-Clause][este link.]]

Copyright (c) 2019, Lucas Vieira.


