posts/oop-java-vs-cl.html
<div id="outline-container-org89c5910" class="outline-3">
<h3 id="org89c5910">Utilitários</h3>
<div class="outline-text-3" id="text-org89c5910">
<p>
Da mesma forma como fizemos no "jeito" anterior, definiremos alguns
procedimentos como utilitários, tanto para gerar nosso contêiner de instâncias
como para gerar nossas operações.
</p>

<p>
As instâncias, seja lá quais forem, serão armazenadas em uma lista. O <i>form</i>
<code>collect</code>, no <i>macro</i> <code>iter</code>, garante que cada uma das instâncias geradas sejam
incorporadas ao fim da lista. Enquanto isso, <code>make-instance</code> demonstra como
podemos instanciar uma classe qualquer (veja a utilização das chaves previamente
definidas nos <code>:initarg</code> dos <i>slots</i> de cada classe).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">make-shapes</span> (num-shapes)
  (iter (for x from 1 to (/ num-shapes 3))
        (collect (make-instance 'circle   <span class="org-builtin">:radius</span> x))
        (collect (make-instance 'square   <span class="org-builtin">:side</span> x))
        (collect (make-instance 'pentagon <span class="org-builtin">:side</span> x))))

(<span class="org-keyword">defun</span> <span class="org-function-name">sum-of-perimeters</span> (list)
  (iter (for elt in list)
        (sum (perimeter elt))))

(<span class="org-keyword">defun</span> <span class="org-function-name">sum-of-areas</span> (list)
  (iter (for elt in list)
        (sum (area elt))))
</pre>
</div>
</div>
<div id="outline-container-org3329c93" class="outline-4">
<h4 id="org3329c93">Soma dos quadrados dos lados</h4>
<div class="outline-text-4" id="text-org3329c93">
<p>
Temos um pequeno problema ao calcularmos as somas dos quadrados dos lados:
alguns de nossos objetos (mais especificamente, aqueles que sejam instâncias de
<code>circle</code>) não implementam o método <code>squared-side</code>. Como proceder?
</p>

<p>
Há diversas formas de fazer isto. Podemos implementar um método a ser chamado
para toda e qualquer mensagem enviada a <code>circle,</code> que não tenha uma resposta
definida; mas não abordaremos isto aqui. Outra forma seria <i>tratar a condição
sinalizada</i> quando o método não está implementado para o objeto<sup><a id="fnr.13" class="footref" href="#fn.13" role="doc-backlink">13</a></sup>.
</p>

<p>
Mas faremos isto de forma ainda mais simples, para manter o código mais sucinto.
</p>

<p>
Lembra-se da definição da nossa operação genérica <code>squared-side</code>? Pois bem, Common
Lisp é uma linguagem que permite a reescrita e a recompilação de certos "blocos"
de código, mesmo enquanto o programa continua sendo executado. Podemos tanto
escrever uma nova definição para <code>squared-side</code> quanto editar diretamente a
definição inicial e recompilá-la, caso estivéssemos utilizando uma IDE de Common
Lisp.
</p>

<p>
Nesta nova definição da operação genérica, temos um <i>form</i> extra ao fim,
começado com <code>:method</code>, que define a <b>implementação padrão</b> do método para quaisquer
classes que não possuam implementação para ele. Como queremos que círculos
passem a não influenciar na soma, podemos criar, neste <i>form</i>, um método que
simplesmente retorna o valor <code>0</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defgeneric</span> <span class="org-function-name">squared-side</span> (shape)
  (<span class="org-builtin">:documentation</span> <span class="org-doc">"Squares the side value of a regular shape."</span>)
  (<span class="org-builtin">:method</span> (obj) 0))
</pre>
</div>

<p>
Depois disso, basta implementar a função de soma dos quadrados dos lados, como
se absolutamente nenhuma inconsistência pudesse acontecer antes.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sum-of-squared-sides</span> (list)
  (iter (for elt in list)
        (sum (squared-side elt))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0c11e75" class="outline-3">
<h3 id="org0c11e75">Função principal para testes</h3>
<div class="outline-text-3" id="text-org0c11e75">
<p>
Definamos uma função qualquer, incumbida de gerar nossa sequência de dez formas,
e então imprimir os resultados das operações na tela. O uso do nome <code>main</code> aqui é
arbitrário, podendo ser substituído por qualquer outra coisa.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">main</span> ()
  (<span class="org-keyword">let</span> ((shapes (make-shapes 10)))
    (format t <span class="org-string">"Sum of Perimeters: ~a~%"</span>
            (sum-of-perimeters shapes))
    (format t <span class="org-string">"Sum of Areas: ~a~%"</span> (sum-of-areas shapes))
    (format t <span class="org-string">"Sum of Squared Sides: ~a~%"</span>
            (sum-of-squared-sides shapes))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org16c29c8" class="outline-2">
<h2 id="org16c29c8">Conclusão</h2>
<div class="outline-text-2" id="text-org16c29c8">
<p>
Chegamos ao fim de ambas as implementações do mesmo problema. Possuimos duas
formas de resolução, sob o que outrora seria o mesmo paradigma, porém estas duas
formas mostraram-se bem diferentes.
</p>
</div>
<div id="outline-container-org5505b2c" class="outline-3">
<h3 id="org5505b2c">Comparação</h3>
<div class="outline-text-3" id="text-org5505b2c">
<p>
Podemos montar um pequeno quadro, destacando as partes mais relevantes das
implementações e estabelecendo um paralelo entre elas.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><i>Feature</i></th>
<th scope="col" class="org-left">Java</th>
<th scope="col" class="org-left">Common Lisp</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Abrangência da OO</td>
<td class="org-left">Obrigatória</td>
<td class="org-left">Suportada</td>
</tr>

<tr>
<td class="org-left">Dados internos do objeto</td>
<td class="org-left">Campos privados</td>
<td class="org-left"><i>Slots</i></td>
</tr>

<tr>
<td class="org-left">Modelagem genérica</td>
<td class="org-left">Interface</td>
<td class="org-left"><i>Generics</i></td>
</tr>

<tr>
<td class="org-left">Implementação do modelo genérico</td>
<td class="org-left">Total</td>
<td class="org-left">Parcial</td>
</tr>

<tr>
<td class="org-left">Localização dos métodos</td>
<td class="org-left">Na definição da classe</td>
<td class="org-left">No pacote ou no <i>top level</i></td>
</tr>

<tr>
<td class="org-left">Abstração mental do método</td>
<td class="org-left">Ação relacionada ao objeto</td>
<td class="org-left">Mensagem passada ao objeto</td>
</tr>
</tbody>
</table>

<p>
Neste momento, peço que pause e pondere a respeito do que apresentei neste
artigo. Veja se meu paralelo parece fazer sentido, se você notou mais alguma
diferença (ou se não notou diferença alguma).
</p>

<p>
Independente do conceito visto como melhor por você, leitor, lembre-se de que
situações específicas exigem ferramentas específicas.
</p>
</div>
</div>
<div id="outline-container-org0d60e7e" class="outline-3">
<h3 id="org0d60e7e"><i>Tangling</i> dos arquivos</h3>
<div class="outline-text-3" id="text-org0d60e7e">
<p>
Como este artigo foi escrito no Emacs, em <code>org-mode</code>, você poderá obter o código
do mesmo a seguir. Os arquivos das linguagens Java e Common Lisp,
contendo o código-fonte em si, poderão ser obtidos ao colocar-se o
cursor sobre o bloco de código a seguir, e utilizando o atalho <code>C-c C-c</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-tangle)
</pre>
</div>

<a href="./oop-java-vs-cl.org">Clique aqui para ir para o código-fonte.</a>
</div>
</div>
<div id="outline-container-orgef1ddb8" class="outline-3">
<h3 id="orgef1ddb8">Licenciamento</h3>
<div class="outline-text-3" id="text-orgef1ddb8">
<p>
Todo e qualquer código descrito aqui é disponibilizado sob a licença BSD
2-Clause. Para mais informação, veja <a href="https://opensource.org/licenses/BSD-2-Clause">este link.</a>
</p>

<p>
Copyright (c) 2019, Lucas Vieira.
</p>
</div>
</div>
</div>
