src/posts/oop-java-vs-cl.org
* Footnotes

[fn:1] Boa parte do que levo em consideração como sendo "orientação a objetos
como originalmente concebida" foi o que vi Alan Kay explicando, em pessoa, na
sua [[https://www.youtube.com/watch?v=oKg1hTOQXoY][palestra na OOPSLA 1997]]. Minha descrição é compacta, então uma melhor
compreensão dos aspectos e do contexto podem ser vistos na palestra em si.

[fn:2] Um círculo pode ser definido, matematicamente, como uma coordenada no
plano, e o tamanho do seu raio. Como não lidaremos com a posição do círculo em
nenhuma das hipóteses apresentadas, só precisamos obrigar o programador a
fornecer o raio do círculo. Este conceito de mínimo de atributos necessários
acaba se estendendo também ao quadrado e ao pentágono regulares que, aqui, são
determinados pelos tamanhos de seus lados.

[fn:3] Para mais informações: [[https://pt.wikihow.com/Descobrir-a-%C3%81rea-de-um-Pent%C3%A1gono][wikiHow - Como Descobrir a Área de um Pentágono]].

[fn:4] Vide o livro [[https://www.amazon.com/Art-Metaobject-Protocol-Gregor-Kiczales/dp/0262610744][The Art of the Metaobject Protocol]]. Infelizmente ainda não
tive a oportunidade de lê-lo, mas Alan Kay sugere que este livro é uma boa
literatura para a compreensão de como a orientação a objetos deveria ser
implementada.

[fn:5] Para saber mais sobre CLOS, você pode ler, de graça, os capítulos
relevantes do livro Practical Common Lisp, [[http://www.gigamonkeys.com/book/object-reorientation-generic-functions.html][aqui]] e [[http://www.gigamonkeys.com/book/object-reorientation-classes.html][aqui]]. Ademais, recomendo a
[[http://www.gigamonkeys.com/book/][leitura completa do livro]] para maiores informações sobre a linguagem.

[fn:6] O motivo para esta substituição é puramente arbitrário; ando
experimentando com o uso de um vocabulário mais "líspico", ao invés do formato
com átomos aparentemente soltos que o macro ~loop~ disponibiliza, por mera questão
de corretude, mas isto é desnecessário. Para mais informações acerca disso, veja
[[https://dspace.mit.edu/bitstream/handle/1721.1/41498/AI_WP_324.pdf][este paper]], de Jonathan Amsterdan (também disponível [[https://common-lisp.net/project/iterate/doc/Don_0027t-Loop-Iterate.html][em HTML]]).

[fn:7] A real forma de utilização destas chaves será vista na seção de
Utilitários, mais adiante.

[fn:8] Um ~:reader~ de um /slot/ define apenas uma forma de recuperação dos dados,
dada uma instância qualquer da classe. Para que o valor seja alterado, é
necessário definir um ~:writer~. Por exemplo, caso o ~:writer~ para o raio do
círculo fosse chamado ~radius~, poderíamos redefinir o raio com ~(setf (radius
instancia) valor)~. Adicionalmente, quando o ~:reader~ e o ~:writer~ têm o mesmo
nome, podemos simplesmente definir o que chamamos de ~:accessor~. Se ~radius~ fosse
o ~:accessor~ do raio, poderíamos tanto recuperar o raio com ~(radius instancia)~
quanto redefinir o raio com ~(setf (radius instancia) valor)~. Isto evita a
necessidade da utilização de funções de acesso a um /slot/ de uma classe, e também
evita a necessidade de definir genéricos e métodos para tal.

[fn:9] Na verdade, é possível definirmos métodos, sem a necessidade de
especificar as operações genéricas para eles (neste caso, o compilador criará as
operações genéricas automaticamente). Todavia, é boa prática ter genéricos
especificados previamente, da mesma forma como um /overview/ do conteúdo de um
arquivo em ~C/C++~ é melhor identificado pelos protótipos nos cabeçalhos (arquivos
~.h~, ~.hpp~, ~.hxx~, etc).

[fn:10] Podemos ter métodos que são despachados de acordo com os tipos de um ou
mais argumentos, ou seja, mais de um argumento pode ter o nome de sua classe
especificado na implementação do método. Isto é mais útil que realizar
verificações por tipos de classes para certos argumentos.

[fn:11] Em Lisp, /macros/ são estruturas capazes de gerar partes de código em
tempo de compilação, efetivamente sendo as estrelas da metaprogramação na
linguagem, juntamente com a chamada homoiconicidade. Contudo, dialetos de Lisp
são famosos por tornar a definição de /macros/ uma tarefa extremamente simples,
além de encorajada -- desde que, como qualquer outra /feature/ de uma linguagem,
não haja abusos em seu uso.

[fn:12] Em Common Lisp, funções aninhadas são definidas através dos "blocos"
~flet~ e ~labels~ (este último é capaz de definir funções aninhadas recursivas),
sendo as funções definidas sob estes blocos válidas até o final do "bloco" em
si. O equivalente em comportamento para /macros/ é o ~macrolet~.

[fn:13] Enquanto algumas linguagens orientadas a objetos possuem o conceito de
exceções que são sinalizadas quando uma situação ocorre -- exceções estas que,
quando não-tratadas, interrompem imediatamente a execução do programa --, Common
Lisp possui a ideia de /conditions/, que suportam a intervenção direta do
programador no REPL ou na IDE, quando não são tratadas. O tratamento de uma
exceção normalmente ocorre através da utilização de blocos ~try-catch~, enquanto
/conditions/ possuem ~handlers~, que podem também estar associados à chamada
automática de ~restarts,~ sejam eles definidos ou não pelo programador. Mais sobre
isto poderá ser visto no [[http://www.gigamonkeys.com/book/beyond-exception-handling-conditions-and-restarts.html][capitulo relevante]] do Practical Common Lisp.
