posts/oop-java-vs-cl.html
<div id="footnotes">
<h2 class="footnotes">Notas de Rodap&eacute;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Boa parte do que levo em consideração como sendo "orientação a objetos
como originalmente concebida" foi o que vi Alan Kay explicando, em pessoa, na
sua <a href="https://www.youtube.com/watch?v=oKg1hTOQXoY">palestra na OOPSLA 1997</a>. Minha descrição é compacta, então uma melhor
compreensão dos aspectos e do contexto podem ser vistos na palestra em si.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Um círculo pode ser definido, matematicamente, como uma coordenada no
plano, e o tamanho do seu raio. Como não lidaremos com a posição do círculo em
nenhuma das hipóteses apresentadas, só precisamos obrigar o programador a
fornecer o raio do círculo. Este conceito de mínimo de atributos necessários
acaba se estendendo também ao quadrado e ao pentágono regulares que, aqui, são
determinados pelos tamanhos de seus lados.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Para mais informações: <a href="https://pt.wikihow.com/Descobrir-a-%C3%81rea-de-um-Pent%C3%A1gono">wikiHow - Como Descobrir a Área de um Pentágono</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Vide o livro <a href="https://www.amazon.com/Art-Metaobject-Protocol-Gregor-Kiczales/dp/0262610744">The Art of the Metaobject Protocol</a>. Infelizmente ainda não
tive a oportunidade de lê-lo, mas Alan Kay sugere que este livro é uma boa
literatura para a compreensão de como a orientação a objetos deveria ser
implementada.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Para saber mais sobre CLOS, você pode ler, de graça, os capítulos
relevantes do livro Practical Common Lisp, <a href="http://www.gigamonkeys.com/book/object-reorientation-generic-functions.html">aqui</a> e <a href="http://www.gigamonkeys.com/book/object-reorientation-classes.html">aqui</a>. Ademais, recomendo a
<a href="http://www.gigamonkeys.com/book/">leitura completa do livro</a> para maiores informações sobre a linguagem.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
O motivo para esta substituição é puramente arbitrário; ando
experimentando com o uso de um vocabulário mais "líspico", ao invés do formato
com átomos aparentemente soltos que o macro <code>loop</code> disponibiliza, por mera questão
de corretude, mas isto é desnecessário. Para mais informações acerca disso, veja
<a href="https://dspace.mit.edu/bitstream/handle/1721.1/41498/AI_WP_324.pdf">este paper</a>, de Jonathan Amsterdan (também disponível <a href="https://common-lisp.net/project/iterate/doc/Don_0027t-Loop-Iterate.html">em HTML</a>).
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A real forma de utilização destas chaves será vista na seção de
Utilitários, mais adiante.
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Um <code>:reader</code> de um <i>slot</i> define apenas uma forma de recuperação dos dados,
dada uma instância qualquer da classe. Para que o valor seja alterado, é
necessário definir um <code>:writer</code>. Por exemplo, caso o <code>:writer</code> para o raio do
círculo fosse chamado <code>radius</code>, poderíamos redefinir o raio com <code>(setf (radius
instancia) valor)</code>. Adicionalmente, quando o <code>:reader</code> e o <code>:writer</code> têm o mesmo
nome, podemos simplesmente definir o que chamamos de <code>:accessor</code>. Se <code>radius</code> fosse
o <code>:accessor</code> do raio, poderíamos tanto recuperar o raio com <code>(radius instancia)</code>
quanto redefinir o raio com <code>(setf (radius instancia) valor)</code>. Isto evita a
necessidade da utilização de funções de acesso a um <i>slot</i> de uma classe, e também
evita a necessidade de definir genéricos e métodos para tal.
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9" role="doc-backlink">9</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Na verdade, é possível definirmos métodos, sem a necessidade de
especificar as operações genéricas para eles (neste caso, o compilador criará as
operações genéricas automaticamente). Todavia, é boa prática ter genéricos
especificados previamente, da mesma forma como um <i>overview</i> do conteúdo de um
arquivo em <code>C/C++</code> é melhor identificado pelos protótipos nos cabeçalhos (arquivos
<code>.h</code>, <code>.hpp</code>, <code>.hxx</code>, etc).
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10" role="doc-backlink">10</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Podemos ter métodos que são despachados de acordo com os tipos de um ou
mais argumentos, ou seja, mais de um argumento pode ter o nome de sua classe
especificado na implementação do método. Isto é mais útil que realizar
verificações por tipos de classes para certos argumentos.
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11" role="doc-backlink">11</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Em Lisp, <i>macros</i> são estruturas capazes de gerar partes de código em
tempo de compilação, efetivamente sendo as estrelas da metaprogramação na
linguagem, juntamente com a chamada homoiconicidade. Contudo, dialetos de Lisp
são famosos por tornar a definição de <i>macros</i> uma tarefa extremamente simples,
além de encorajada &#x2013; desde que, como qualquer outra <i>feature</i> de uma linguagem,
não haja abusos em seu uso.
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12" role="doc-backlink">12</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Em Common Lisp, funções aninhadas são definidas através dos "blocos"
<code>flet</code> e <code>labels</code> (este último é capaz de definir funções aninhadas recursivas),
sendo as funções definidas sob estes blocos válidas até o final do "bloco" em
si. O equivalente em comportamento para <i>macros</i> é o <code>macrolet</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.13" class="footnum" href="#fnr.13" role="doc-backlink">13</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Enquanto algumas linguagens orientadas a objetos possuem o conceito de
exceções que são sinalizadas quando uma situação ocorre &#x2013; exceções estas que,
quando não-tratadas, interrompem imediatamente a execução do programa &#x2013;, Common
Lisp possui a ideia de <i>conditions</i>, que suportam a intervenção direta do
programador no REPL ou na IDE, quando não são tratadas. O tratamento de uma
exceção normalmente ocorre através da utilização de blocos <code>try-catch</code>, enquanto
<i>conditions</i> possuem <code>handlers</code>, que podem também estar associados à chamada
automática de <code>restarts,</code> sejam eles definidos ou não pelo programador. Mais sobre
isto poderá ser visto no <a href="http://www.gigamonkeys.com/book/beyond-exception-handling-conditions-and-restarts.html">capitulo relevante</a> do Practical Common Lisp.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<h3><a href="/pages/blog.html">&#8592; Voltar ao Blog</a></h3><p style="font-size: 0.85em; color: #888; margin-top: 1em; padding: 0.5em; border-left: 3px solid #555;">Os comentários foram desativados em razão da <a href="https://www.planalto.gov.br/ccivil_03/_ato2023-2026/2025/lei/L15211.htm" style="color: #888; text-decoration: underline;">Lei 15.211/2025</a> (ECA Digital, "Lei Felca"). A legislação impõe exigências de moderação que inviabilizam recursos interativos em sites pessoais sem estrutura para tanto.</p>
</div>
</body>
</html>
